ChartsOfCharacteristicTypes/атл_ДополнительныеРеквизитыЗадачиМобильномуСотруднику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>атл_ДополнительныеРеквизитыЗадачиМобильномуСотруднику</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.атл_ЗначенияДополнительныхРеквизитов</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1000</v8:Length>
				</v8:StringQualifiers>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаполняетсяНаМК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРеквизитов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СворачиватьГруппуРеквизитовПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыйВидДополнительногоРеквизита</Name>
					<Type>
						<v8:Type>cfg:EnumRef.атл_ОсобыеВидыДополнительныхРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Enums/атл_ОсобыеВидыДополнительныхРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>атл_ОсобыеВидыДополнительныхРеквизитов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Гиперссылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоллекцияКартинок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ChartsOfCharacteristicTypes/атл_ДополнительныеРеквизитыЗадачиМобильномуСотруднику/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СобытияФормыИЭЛементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйВидДополнительногоРеквизитаПриИзменении(Элемент)
	ОсобыйВидДополнительногоРеквизитаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРеквизитовПриИзменении(Элемент)
	ГруппаРеквизитовПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ПрочиеПроцедуры

&НаСервере
Процедура ДоступностьЭлементовФормы()
	
	Если Объект.ГруппаРеквизитов Тогда
		Элементы.СворачиватьГруппуРеквизитовПоУмолчанию.Доступность = Истина;
		Элементы.ТипЗначения.Доступность = Ложь;
		Элементы.Порядок.Доступность = Ложь;
		Элементы.ЗаполняетсяНаМК.Доступность = Ложь;
		Элементы.Обязателен.Доступность = Ложь;				
		Элементы.ОсобыйВидДополнительногоРеквизита.Доступность 				 = Ложь;		
				
	Иначе
		Элементы.СворачиватьГруппуРеквизитовПоУмолчанию.Доступность = Ложь;		
		Элементы.Порядок.Доступность = Истина;
		
		Если Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Гиперссылка 
				ИЛИ Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.КоллекцияКартинок 
				ИЛИ Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Координата Тогда
			Элементы.ЗаполняетсяНаМК.Доступность = Ложь;		
			Элементы.ТипЗначения.Доступность = Ложь;
		Иначе
			Элементы.ЗаполняетсяНаМК.Доступность = Истина;
			Элементы.ТипЗначения.Доступность = Истина;
		КонецЕсли;
	
		Элементы.Обязателен.Доступность = Истина;		
		Элементы.ОсобыйВидДополнительногоРеквизита.Доступность 				 = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОсобыйВидДополнительногоРеквизитаПриИзмененииНаСервере()
	
	Если Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Гиперссылка Тогда
		Объект.ЗаполняетсяНаМК = Ложь;
		КС = Новый КвалификаторыСтроки(1000);		
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка", , КС);
	ИначеЕсли  Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.КоллекцияКартинок 
				ИЛИ Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Координата Тогда
		Объект.ЗаполняетсяНаМК = Истина;	
		КС = Новый КвалификаторыСтроки(1000);		
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка", , КС);
	КонецЕсли;
	
	ДоступностьЭлементовФормы();	
	
КонецПроцедуры

&НаСервере
Процедура ГруппаРеквизитовПриИзмененииНаСервере()
	
	Если Объект.ГруппаРеквизитов Тогда
		Объект.ЗаполняетсяНаМК = Ложь;
		Объект.Обязателен = Ложь;
		Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.ПустаяСсылка();
		Объект.ТипЗначения = Неопределено;
	Иначе
		Объект.СворачиватьГруппуРеквизитовПоУмолчанию = Ложь;
	КонецЕсли;
	
	ДоступностьЭлементовФормы();

КонецПроцедуры

#КонецОбласти
